{"class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_1", "trainable": true, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_2", "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_2", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_3", "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_3", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_4", "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_4", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_5", "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_5", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_6", "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_6", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 512, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "bias_constraint": null, "name": "dense_1", "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_7", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 512, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "bias_constraint": null, "name": "dense_2", "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_8", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 10, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_3", "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null}}]}